{
     "Title": "Poland embraces West amid Ukraine crisis after years of drifting away",
     "Text": "But on Friday, President Biden arrived in Poland and referred to Andrzej Duda, the country’s president, as a “brother” — praising him for “living up” to his obligations as a leader in responding to the humanitarian crisis resulting from Russia’s invasion of Ukraine.\n\nBiden’s two-day visit to Poland — which included stops in Rzeszow, in the southeast of the country, and Warsaw — underscores the rapidly changing nature of the U.S.-Poland relationship, which has transformed into a close partnership in the face of Russia’s invasion of neighboring Ukraine.\n\n“Putin has the gall to say he's denazifying Ukraine, it's a lie,” President Biden said in a speech from Poland on March 26. (Video: The Washington Post, Photo: The Washington Post)\n\nArriving at Poland’s Presidential Palace for a meeting with Duda on Saturday afternoon, Biden embraced the Polish leader and the two men beamed at the cameras as they shook hands and Biden placed his other hand on Duda’s shoulder.\n\nAdvertisement\n\nStory continues below advertisement\n\nAt the start of an expanded bilateral meeting, Duda said that the relationship between the United States and Poland is “flourishing” and that the bond was “strengthened immensely” by Biden’s visit.\n\nIn his remarks, Biden emphasized the United States’ enduring commitment to defending NATO member states, seeking to reassure the Polish people, who Duda said feel a “great sense of threat” because of Russia’s aggression.\n\n“We take Article 5 as a sacred commitment,” Biden said, referring to the alliance’s collective defense pact. “Not a throwaway, a sacred commitment that relates to every member of NATO.”\n\nBiden’s visit comes at a remarkable moment for Poland. In the lead-up to the Russian invasion of Ukraine, the country made international headlines for its hard-line stance on refugees, its anti-LGBTQ policies and its fraught relationship with both the United States and Europe.\n\nAdvertisement\n\nStory continues below advertisement\n\nBiden seemingly made reference to some of the leaders’ ideological differences on Saturday.\n\n“The most important thing that binds us together are our values: freedom, freedom of the press … that government is transparent, making sure people have the right to vote,” he said.\n\nBut in recent weeks, Polish leaders have pivoted from attacking some of the core institutions of liberal democracy to touting their role as defenders of European unity and values.\n\n“Your presence here, Mr. President, first of all, sends a very big sign of unity,” Duda said Friday before he and Biden received a briefing in Rzeszow on humanitarian efforts. “This is a huge sign of support and Euro-Atlantic unity — unity with my country, with Poland. It demonstrates great friendship between Poland and the United States, and a very profound alliance.”\n\nAdvertisement\n\nStory continues below advertisement\n\nThe fortified bond between Poland and the United States could be temporary, however. The two countries have already clashed briefly over the MiG fighter jet issue, and fissures are emerging over how many refugees Poland has already welcomed. Experts say they hope that Biden will not ignore human rights concerns with Poland simply because of the Ukraine crisis.\n\nBut for now, Warsaw finds itself at the very center of the transatlantic response. It is a front-line NATO state hosting a growing number of troops and weapons, as well as serving as a hub for supplies bound for Ukraine and the site of a historic humanitarian emergency. Poland currently hosts 2.2 million of the 3.7 million Ukrainians who have fled the war, according to United Nations’ estimates.\n\n“We do not call them ‘refugees,’” Duda said Friday. “They are our guests, our brothers, our neighbors from Ukraine who today are in a very difficult situation.”\n\nAdvertisement\n\nStory continues below advertisement\n\nOn Saturday, Biden visited refugees at PGE Narodowy Stadium in Warsaw, meeting with the city’s mayor, Rafal Trzaskowski.\n\nThe president, without a tie and wearing a Beau Biden Foundation hat, traversed a crowd of refugees. At one point, he picked up a little girl in a pink coat and pigtails and took a selfie with her. At another, he embraced a woman in what appeared to be an emotional conversation.\n\nAs he was exiting, the president told reporters he had met some refugees from Mariupol, a Ukrainian city that has been under siege from Russian forces, and said he is always surprised by “the depth and the strength of the human spirit.” When asked about what the stop made him think about President Vladimir Putin, he called the Russian leader “a butcher.”\n\nBut tensions over refugees have started to surface publicly.\n\nAdvertisement\n\nStory continues below advertisement\n\nTrzaskowski, Warsaw’s mayor, warned in an interview with The Washington Post recently that the city’s services were at risk of being overwhelmed.\n\n“In 2015, we had 300,000 to 400,000 people coming into Europe every month. We just had 300,000 people come into Warsaw in three weeks,” he said. “We want to take everyone who needs help, but how many kids can we take into schools? How can we do everything we can so the health system doesn’t break down in our city?”\n\nAnd even as Poland shoulders the heaviest migratory burden stemming from the war, its leaders appear reluctant to embrace a Europe-wide quota system for resettling refugees because it could be applied to future emergencies, preferring an ad hoc approach, according to European diplomats familiar with the discussions, who spoke on the condition of anonymity to discuss sensitive issues.\n\nAdvertisement\n\nStory continues below advertisement\n\nPoland’s Interior Ministry did not respond to a request for comment about its position on a refugee quota.\n\nPoland is also turning back migrants from the Middle East at its border with Belarus, part of a geopolitical standoff with that country.\n\nSome view Russia’s unprovoked assault on Ukraine as an “I told you so” moment for Poland, which, like the Baltics and other countries in Eastern and Central Europe, has long been wary of Russia.\n\n“There is a realization in the West that successive Polish and Central European governments have warned about Putin for 20 years,” said Radoslaw Sikorski, a Polish member of the European Parliament and a former foreign minister. “There is a willingness to listen now to what we are saying — and this moment should be grasped.”\n\nStory continues below advertisement\n\nPoland’s political makeover comes after years of acrimony between the ruling Law and Justice party, or PiS, and Washington and Brussels. Though Poland’s populist leadership cultivated close ties with Washington under President Donald Trump, Biden has been cooler.\n\nAdvertisement\n\nAs a candidate he condemned the creation of so-called “LGBT-free zones” in Poland, tweeting that they have “no place in the European Union or anywhere in the world.” In 2020, he cited Poland alongside Hungary and Belarus as countries where democracy was under threat.\n\nThe Polish ruling party also angered Washington last year with plans for a media law that appeared targeted at Poland’s largest broadcaster, TVN, which is owned by Discovery, a U.S. firm. Duda ultimately vetoed the legislation, allowing Discovery to keep its majority share.\n\nTies with the European Union have been even rockier. For years now, Poland has been caught in a bitter dispute with the bloc over democratic backsliding, particularly when it comes to the rule of law.\n\nSince coming to power in 2015, the Law and Justice party has asserted sweeping executive authority over the judiciary — remaking the process of appointing, promoting and disciplining judges. In 2017, a commission of the Council of Europe warned that the reorganization of the judiciary bore a “striking resemblance with the institutions which existed in the Soviet Union and its satellites.”\n\nAdvertisement\n\nStory continues below advertisement\n\nIt has also sought to turn public media into an organ of the party, prompting a rebuke from Reporters Without Borders, which stated that the country’s public media outlets “have been transformed into government propaganda mouthpieces.”\n\nPoland’s leaders are now pressing Brussels to unfreeze billions of dollars in pandemic recovery funds withheld over questions about the politicization of Poland’s judiciary, arguing that the money is needed to address the refugee crisis.\n\nHuman rights groups and others question how pandemic recovery money — which is earmarked for specific purposes over longer periods of time — would help refugees now, particularly since much of the cost so far has been borne by ordinary Polish citizens, not the government.\n\nCamino Mortera-Martinez, head of the Brussels office of the Center for European Reform, said she worries that the Ukraine crisis will effectively grant Poland a “get out of jail free pass.”\n\nShe believes the European Commission will unfreeze the money “not because Poland needs it, but because it does not want to risk the unity of the bloc at this moment.”\n\nStill, Biden’s hastily planned stop here comes at a crucial time for Poland, and his presence is both substantively and symbolically important.\n\nBiden’s visit “gives hope and security to people in Poland, and probably also relief to many Ukrainians,” said Ryszard Schnepf, a former Polish ambassador to the United States.\n\nThe exigencies of Russia’s war, Schnepf added, have caused the government in Warsaw to bind itself more closely to its Western partners — a display of unity at odds with deepening tensions over Poland’s attacks on the rule of law, the independence of the media and the rights of LGBT people.\n\nSchnepf said that in supporting Poland in this moment, Biden “is not forgetting about the past,” but simply shoring up a crucial ally in the ongoing crisis with Ukraine.\n\n“It is significant to host the leader of the most important ally of Poland, as far as security is concerned,” Schnepf said. “It shows us that this is a very personal involvement from President Biden.”",
     "Summary": "“Putin has the gall to say he's denazifying Ukraine, it's a lie,” President Biden said in a speech from Poland on March 26.\nThe two countries have already clashed briefly over the MiG fighter jet issue, and fissures are emerging over how many refugees Poland has already welcomed.\nExperts say they hope that Biden will not ignore human rights concerns with Poland simply because of the Ukraine crisis.\n“We do not call them ‘refugees,’” Duda said Friday.\n“It shows us that this is a very personal involvement from President Biden.”",
     "Source": "https://www.washingtonpost.com/politics/"
}