{
     "Title": "Biden says Putin ‘cannot remain in power’ as he assures Ukraine: ‘We stand with you’",
     "Text": "NEW You can now listen to Fox News articles!\n\nPresident Biden on Saturday said that Russian President Vladimir Putin \"cannot remain in power,\" as he declared the Russian invasion of Ukraine a \"strategic failure\" while pledging continued support for the embattled Ukrainian people.\n\n\"For God’s sake, this man cannot remain in power,\" Biden said during a speech in front of the Royal Castle in Warsaw, Poland.\n\nBIDEN CALLS PUTIN A ‘BUTCHER’ AFTER MEETING WITH UKRAINIAN REFUGEES IN POLAND\n\nIt appeared to be the first time Biden has explicitly called for Putin’s removal and would mark a sharp contrast from prior statements from the White House, which have emphasized that regime change in Russia is not the policy of the United States.\n\nShortly after Biden's address however, the White House denied that Biden was calling for regime change.\n\n\"The President’s point was that Putin cannot be allowed to exercise power over his neighbors or the region. He was not discussing Putin’s power in Russia, or regime change,\" a White House official told Fox News Digital shortly after the speech concluded.\n\nThe remark came at the end of an address in which he took a strong line against the Russian incursion into Ukraine -- calling the aggression \"nothing less than a direct challenge to the rule-based international order established since the end of World War II.\"\n\nIn the speech, in which he referenced Polish Pope St. John Paul II and former president Lech Walesa, he also gave a stark warning to Putin about any potential move into the territory of NATO allies, including Poland.\n\n\"Don't even think about moving on one single inch of NATO territory,\" he said. \"We have a sacred obligation under Article five to defend each and every inch of NATO territory with the full force of our collective power.\"\n\nIn the speech he stressed the importance of collective action -- highlighting both U.S. and international aid to Ukraine, and sanctions on Moscow that have torpedoed the Russian economy and declared that the ruble had been reduced to \"rubble.\" He also said that \"this war has already been a strategic failure for Russia,\" claiming that Putin thought the Ukrainian people \"would roll over and not fight.\"\n\nRUSSIA INVADES UKRAINE: LIVE UPDATES\n\nBiden cast the fight against Ukraine as one of a continuing battle for freedom that had been seen in Poland in the fight for freedom against the Soviet Union -- and called for the international community to stay united.\n\n\"We must commit now to be in this fight for the long haul. We must remain unified today and tomorrow and the day after and for the years and decades to come,\" he said. \"It will not be easy. There will be cost, but it's a price we have to pay because the darkness that drives autocracy is ultimately no match for the flame of liberty that lights the souls of free people everywhere.\"\n\nHe also had a message for the Ukrainian people: \"We stand with you. Period.\"\n\nHe also attempted to speak directly to the Russian people who oppose Putin’s invasion of their neighbor.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"This is not who you are. This is not the future reserve you deserve for your families and your children. I'm telling you the truth. This war is not worthy of you, the Russian people,\" he said. \"Putin can and must end this war. The American people will stand with you and the brave citizens of Ukraine who want peace.\"\n\nThe crowd of about 1,000 included Ukrainian refugees who had fled for Poland. Earlier in the day he met with refugees in Poland’s capital. More than 3.7 million have fled Ukraine since the war began, with more than 2.2 million crossing into Poland.\n\nFox News' Peter Doocy and The Associated Press contributed to this report.",
     "Summary": "President Biden on Saturday said that Russian President Vladimir Putin \"cannot remain in power,\" as he declared the Russian invasion of Ukraine a \"strategic failure\" while pledging continued support for the embattled Ukrainian people.\n\"For God’s sake, this man cannot remain in power,\" Biden said during a speech in front of the Royal Castle in Warsaw, Poland.\nShortly after Biden's address however, the White House denied that Biden was calling for regime change.\n\"The President’s point was that Putin cannot be allowed to exercise power over his neighbors or the region.\nMore than 3.7 million have fled Ukraine since the war began, with more than 2.2 million crossing into Poland.",
     "Source": "https://www.foxnews.com/politics"
}